close all;clear;clc;

%   r   =   H  *  w
% [m*1] = [m*n]*[n*1]
% w = (inv(H'*H))*H'*r
m=50000;  % 信号观测次数
n=19;  % 自己构造的H矩阵的维数
P=rand(m,3);
H=ones(m,n);
r=-(sum(((log(P)/log(3)).*P)'))';
% l^3+al^2+bl+c=0
% pi=-li/a
% p^3-p^2+b/a^2*p-c/a^3=0
% b/a^2=(p1p2+p1p3+p2p3)->para1 ;c/a^3=p1p2p3->para2
% 注意到此时已经无法通过归一化的解p来复原a,b,c了，因此转换为对参数para1和para2的操作
t1 = P(:,1).*P(:,2) + P(:,1).*P(:,3) + P(:,2).*P(:,3);
t2 = P(:,1).*P(:,2).*P(:,3);
H(:,2:n) = [t1, t2, t1.^2, t2.^2, t1.^3, t2.^3, t1.^4, t2.^4, ...
    t1.*t2, (t1.^2).*t2, t1.*(t2.^2), (t1.*t2).^2, ...
    t2./t1, t1./t2, (t1.^2)./t2, (t2.^2)./t1, (t1./t2).^2, (t2./t1).^2];
w=(inv(H'*H))*H'*r;
save('train1');