clear; close all; clc;

%% 参数设定

h = 6.63*10^(-34);
h_ = h/(2*pi);
m0 = 9.1*10^(-31);
a = 5.43*10^(-10);

%% 对V(x)进行泰勒展开
% 直接计算得到结果 单位：10^(-18)J
v0 = 0.1/pi;
v1 = 0.1/4;
v2 = 0.1/(3*pi);
v3 = 0;
v4 = -0.1/(15*pi);

%% 特征根法求解

a1 = (h_*pi/a)^2/(2*m0)*10^(18);
syms k E
% 单位： E:10^(-18)J  k:pi/a
M = [a1*(k-4)^2+v0-E,  v1,  v2,  v3,  v4;
    v1,  a1*(k-2)^2+v0-E,  v1,  v2,  v3;
    v2,  v1,  a1*k^2+v0-E,  v1,  v2;
    v3,  v2,  v1,  a1*(k+2)^2+v0-E,  v1;
    v4,  v3,  v2,  v1,  a1*(k+4)^2+v0-E];
equ = (det(M)==0);

% e为不同简约波矢k对应的能量E
e = [];

for k = -1:0.01:1
    equ2 = subs(equ);
    [S] = solve(equ2,E);
    e = [e,sort(double(S))];
end

figure(1)
for i =1:5
    plot(-1:0.01:1,e(i,:));
    hold on;
end
xlabel('k(\pi/a)')
ylabel('E(1\times10^{-18} J)')
title('特征根法');

% 计算带隙
de = zeros(size(e,1)-1,1);
for i = 1:length(de)
    de(i) = min(e(i+1,:)) - max(e(i,:));
end

%% 近自由电子近似

del = 1/5+0.0001;    %小于del认定为布里渊区“附近”
v = [1/4,1/(3*pi),0,-1/(15*pi),0].*10^(-19);
v0 = (1/pi)*10^(-19);

% 自由电子E-k关系
E = [];
for k = -5:0.01:5
    E = [E,h_^2/(2*m0)*k^2*(pi/a)^2];
end

% 利用微扰论进行修正，此时为扩展布里渊区图景
% 这一部分参照了马可学长的代码
for k = -5:0.01:5
    N = floor(k);
    if(k>N+0.5)
        N = N+1;
    end
    n = abs(N);
    if((n~=0)&& (abs(k-N) <= del) && v(n)~=0 && k<=0)
        %对布里渊区边界附近做简并修正
        Ek = E(round((k+5)/0.01)+1);
        Ekk = E(round((k+2*n+5)/0.01)+1);
        E1 = 1/2*(Ek+Ekk + ((Ek-Ekk)^2+4*v(n)^2)^(1/2));
        E2 = 1/2*(Ek+Ekk - ((Ek-Ekk)^2+4*v(n)^2)^(1/2));
        if(Ek > Ekk)
            E(round((k+5)/0.01)+1) = E1;
            E(round((k+2*n+5)/0.01)+1) = E2;
        else
            E(round((k+5)/0.01)+1)= E2;
            E(round((k+2*n+5)/0.01)+1) = E1;
        end       
    else
        if(n == 0 || (abs(k-N)>=del) || v(n) == 0)
            Ek = E(round((k+5)/0.01)+1);
            for i = -4:1:4
                if(i~=0)
                    Ek = Ek + v(abs(i))^2/(h_^2/(2*m0)*(pi/a)^2*(k^2-(k+2*i)^2));
                end
            end
            E(round((k+5)/0.01)+1) = Ek;
        end
    end
end

% 将扩展布里渊区图景转化为简约布里渊区图景，并补充布里渊区边界点，同时加上V0
% 这一部分参照了张旭东学长的代码
e1 = [h_^2/(2*m0)*1^2*(pi/a)^2 - abs(v(1)),...
    E(round((-0.99+5)/0.01)+1:round((0.99+5)/0.01)+1),...
    h_^2/(2*m0)*1^2*(pi/a)^2 - abs(v(1))]+v0;
e2 = [h_^2/(2*m0)*1^2*(pi/a)^2 + abs(v(1)),...
    E(round((1.01+5)/0.01)+1:round((1.99+5)/0.01)+1),...
    h_^2/(2*m0)*2^2*(pi/a)^2 - abs(v(2)),...
    E(round((-1.99+5)/0.01)+1:round((-1.01+5)/0.01)+1),...
    h_^2/(2*m0)*1^2*(pi/a)^2 + abs(v(1))]+v0;
e3 = [h_^2/(2*m0)*3^2*(pi/a)^2,...
    E(round((-2.99+5)/0.01)+1:round((-2.01+5)/0.01)+1),...
    h_^2/(2*m0)*2^2*(pi/a)^2 + abs(v(2)),...
    E(round((2.01+5)/0.01)+1:round((2.99+5)/0.01)+1),...
    h_^2/(2*m0)*3^2*(pi/a)^2]+v0;
e4 = [h_^2/(2*m0)*3^2*(pi/a)^2,...
    E(round((3.01+5)/0.01)+1:round((3.99+5)/0.01)+1),...
    h_^2/(2*m0)*4^2*(pi/a)^2 - abs(v(4)),...
    E(round((-3.99+5)/0.01)+1:round((-3.01+5)/0.01)+1),...
    h_^2/(2*m0)*3^2*(pi/a)^2]+v0;
e5 = [h_^2/(2*m0)*5^2*(pi/a)^2,...
    E(round((-4.99+5)/0.01)+1:round((-4.01+5)/0.01)+1),...
    h_^2/(2*m0)*4^2*(pi/a)^2 + abs(v(4)),...
    E(round((4.01+5)/0.01)+1:round((4.99+5)/0.01)+1),...
    h_^2/(2*m0)*5^2*(pi/a)^2]+v0;

%% 作图与对比

%近自由电子近似下的简约布里渊区图景
figure(2);
plot(-1:0.01:1,e1);
hold on;
plot(-1:0.01:1,e2);
plot(-1:0.01:1,e3);
plot(-1:0.01:1,e4);
plot(-1:0.01:1,e5);
title('近自由电子近似')
xlabel('k(\pi/a)');
ylabel('E(J)');

% 计算带隙
de1 = zeros(4,1);
de1(1) = min(e2) - max(e1);
de1(2) = min(e3) - max(e2);
de1(3) = min(e4) - max(e3);
de1(4) = min(e5) - max(e4);

% 能带曲线比较
figure(3)

for i =1:5
    plot(-1:0.01:1,e(i,:)*10^(-18),'k');
    hold on;
end
plot(-1:0.01:1,e1,'r');
plot(-1:0.01:1,e2,'r');
plot(-1:0.01:1,e3,'r');
plot(-1:0.01:1,e4,'r');
plot(-1:0.01:1,e5,'r');
xlabel('k(\pi/a)');
ylabel('E(J)');
title('能带曲线比较');