clear;clc;
%% 定义参数
%采用曲子《修炼爱情》
freq  = pitchtofreq('E','2_3_2_1_62_2_02_3_2_1_52_2_71_01_2_3_4_4_61_767502_3_2_1_1_62_3_2_1_1_62_3_2_1_1_52_71_05341_1_0671_71_2_2_');
%存放对应每一个唱名的持续拍数

time = ...
    [0.25,0.25,0.25,0.25,...%2_3_2_1_
    0.5,0.25,1.25,1,0.25,0.25,0.25,0.25,...%62_2_02_3_2_1_
    0.5,0.25,0.75,0.25,1.25,0.5,0.25,0.25,...%52_2_71_01_2_
    0.5,0.25,0.5,0.75,0.5,0.25,0.5,0.75,...%3_4_4_61_767
    2,1,0.25,0.25,0.25,0.25,...%502_3_2_1_
    0.25,0.75,0.25,0.25,0.25,0.25,0.25,0.75,0.25,0.25,0.25,0.25,...%1_62_3_2_1_1_62_3_2_1_
    0.5,0.25,0.75,0.25,1.25,0.5,0.25,0.25,...%1_52_71_053
    0.5,0.25,0.25,0.5,0.25,0.25,0.5,0.25,0.5,0.5,1.25];%41_1_0671_71_2_2_
%beat = 1;%一拍的持续时间
sample = 8000;%采样率为8kHz，所以每拍（大概1s）是8000个采样点
value = [];%存放最后的采样值
total = sum(sample*time);
total_time = linspace(0,sum(time)*0.5,sample*length(time)).';
cover = 200;
%% 音乐合成
tail = zeros(cover,1);
for m = 1:length(freq)
    %创建一个时间采样序列,长度由唱名的持续拍数决定
    t = linspace(0,time(m)*0.5,sample*time(m)).';
    all = (sin(2*pi*freq(m)*t)+0.2*sin(2*pi*2*freq(m)*t)+0.3*sin(2*pi*3*freq(m)*t)).*shape_linear(t*6/t(end)); %线性包络
    %all = (sin(2*pi*freq(m)*t)+0.2*sin(2*pi*2*freq(m)*t)+0.3*sin(2*pi*3*freq(m)*t)).*exp(-1*t*6/t(end)); %指数包络
    %下面尝试叠加
    head = all(1:cover);
    body = all(cover + 1:end - cover);
    head = head + tail;
    value = [value;head;body];
    tail = all(end-cover + 1:end);
end
value = [value;tail];
%% 音乐播放、保存、波形显示
sound(value,8000);
audiowrite('exe5.wav',value,8000);%保存